package com.example.salavat;

import androidx.appcompat.app.AppCompatActivity;
import androidx.constraintlayout.widget.*;

import android.os.*;
import android.widget.*;

import java.util.concurrent.*;

public class MainActivity extends AppCompatActivity {
    Handler handler = new Handler();
    String[] textsArabic = new String[30];
    String[] textsTranslate = new String[30];
    int currentPage = 0;
    ConstraintLayout myLayout;
    TextView arabic;
    //TextView mtranslate;



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        myLayout = findViewById(R.id.myLayout);
        arabic = findViewById(R.id.arabic);
        //mtranslate = findViewById(R.id.translate);

        initArabic();
        //initRussian();



        Thread t = new Thread(new Runnable(){
            public void run(){
                try{
                    TimeUnit.MILLISECONDS.sleep(100);
                    handler.post(r);
                }catch(InterruptedException e){
                    e.printStackTrace();
                }
            }
        });
        t.start();

        myLayout.setOnTouchListener(new OnSwipeTouchListener(MainActivity.this) {

            @Override
            public void onSwipeRight() {
                currentPage--;
            }

            @Override
            public void onSwipeLeft() {
                currentPage++;
            }
        });
    }

    public void initArabic() {
        textsArabic[0] = "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي ا لْأَوَّلِينَ وَ ا لْآخِرِ ينَ وَ فِي ا لْمَلَا ءِ ا لْأَ عْلَى اِلَى يَوْمِ ا لدِّينِ";
        textsArabic[1] = "أللَّهُمَّ صَلِّ وَ سَلِّمْ وَ بَارِكْ عَلَى سَيِّدِنَا مُحَمَّدِنِ الْفَاتِحِ لِمَا أُغْلِقَ وَالْخَاتِمِ لِمَا سَبَقَ وَ نَاصِرِ الْحَقِّ بِالْحَقِّ وَالْهَادِي إِلَى صِرَاطِكَ الْمُسْتَقِيم صَلَّى ٱللَّٰهُ تَعَالَى عَلَيْهِ وَ عَلَى آلِهِ وَ أَ صْحَابِهِ حَقَّ قَدْرِهِ وَ مِقْدَارِهِ الْعَظِيمِ";
        textsArabic[2] = "السَلَامُ عَلَيْكَ أيُّهَا النَّبِيُّ وَ رَحْمَةُ اللهِ تَعَالَى وَ بَرَكَاتُهُ";
        textsArabic[3] = "اَللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَ نَبِيِّكَ وَ رَسُو لِكَ النَّبِيِّ اْلأُمِّيِّ وَ عَلَى آَلِهِ وَ صَحْبِهِ وَ سَلِّمْ";
        textsArabic[4] = "صَلَوَاتُ اللهِ وَ مَلَاإِكَتِهِ وَأَنْبِيَاإِهِ وَ رُسُلِهِ وَجَمِيعِ خَلْقِهِ عَلَى سَيِّدِنَا مُحَمَّدٍ وَ عَلَى آَلِ سَيِّدِنَا مُحَمَّدٍ عَلَيْهِ وَ عَلَيهِمْ السَّلَامُ وَ رَحْمَةُ اللهِ تَعَالَى وَ بَرَكَاتُهُ";
        textsArabic[5] = "اللَّهُـمَّ صَلِّ عَلَـى مُحَمَّـدٍ، وَعَلَـى آلِ مُحَمَّدٍ، كَمَـا صَلَّيـتَ عَلَـى إبْرَاهِـيمَ وَعَلَـى آلِ إبْرَاهِـيمَ، إِنَّكَ حَمِـيدٌ مَجِـيدٌ ، اللَّهُـمَّ بَارِكْ عَلَـى مُحَمَّـدٍ، وَعَلَـى آلِ مُحَمَّـدٍ، كَمَـا بَارِكْتَ عَلَى إبْرَاهِـيمَ وَعَلَـى آلِ إبْرَاهِيمَ، إِنَّكَ حَمِـيدٌ مَجِـيدٌ";
        textsArabic[6] = "اللّهُـمَّ صَلِّ عَلَـى مُحَمَّـدٍ وَعَلَى أَزْوَاجِـهِ وَذُرِّيَّـتِهِ، كَمَـا صَلَّيْـتَ عَلَـى آلِ إبْرَاهِـيمَ . وَبَارِكْ عَلَـى مُحَمَّـدٍ وَعَلَى أَزْوَاجِـهِ وَذُرِّيَّـتِهِ، كَمَـا بَارِكْتَ عَلَـى آلِ إبْرَاهِـيمَ . إِنَّكَ حَمِـيدٌ مَجِـيدٌ";
        textsArabic[7] = "اَللَّهُمَّ صَلِّ صَلَاةً كَامِلَةً وَسَلِّمْ سَلَامًا تَامًّا عَلَى سَيِّدِنَا مُحَمَّدٍ الَّذِي تَنْحَلُّ بِهِ الْعُقَدُ وَتَنْفَرِجُ بِهِ الْكُرَبُ وَتُقْضَى بِهِ الْحَوَائِجُ وَتُنَالُ بِهِ الرَّغَائِبُ وَحُسْنُ الْخَوَاتِمِ وَيُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ الْكَرِيمِ وَعَلَى آلِهِ وَصَحْبِهِ فِي كُلِّ لَمْحَةٍ وَنَفَسٍ بِعَدَدِ كُلِّ مَعْــلُومٍ لَكَ";
        textsArabic[8] = "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ طِبِّ الْقُلُوبِ وَدَوَاءِهَا وَ عَافِيَةِ الْأَبْدَانِ وَشِفَاءِهَا وَ نُورِ الْأَبْصَارِ وَضِيَا أِهَا وَ عَلَى آلِهِ وَ صَحْبِهِ وَ سَلِّمْ";
        textsArabic[9] = "اَللَّهُمَّ صَلِّي وَ سَلِّمْ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَ عَلَى آلِهِ وَ صَحْبِهِ وَ سَلِّمْ";
        textsArabic[10] = "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَ عَلَى آلِ سَيِّدِنَا مُحِمَّدٍ، صَلَاةً تُنَجِّينَا بِهَا مِنْ جَمِيعِ الْأَهوَالِ وَالْأَفَاتِ، وَتَقْضِي لَنَا بِهَا جَمِيعَ الْحَاجَاتِ وَتُطَهِّرُنَا بِهَا مِنْ جَمِيعِ السَّيِّئَاتِ وَتَرْفَعُنَا بِهَا أَعْلَى الدَّرَجَاتِ وَتُبَلِّغُنَا بِهَا أَقْصَى الْغَايَاتِ مِنْ جَمِيعِ الْخَيْرَاتِ فِي الْحَيَاةِ وَبَعْدَ الْمَمَاتِ، بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينِ. حَسْبُنَا اللهُ وَ نِعْمَ الوَكِيلُ، نِعْمَ المَوْلَى وَ نِعْمَ النَّصِيرُ، غُفْرَانَكَ رَبَّنَا وَاِلَيْكَ الْمَصِيرُ";


    }


/*
    public void initRussian() {
        textsTranslate[0] = "О Аллах! Ниспошли благословение Мухаммаду с первых и до последних дней и в Высшем Собрании (среди ангелов), вплоть до Судного дня";
        textsTranslate[1] = "Славословия и приветствия нашему господину Мухаммаду ﷺ. Он - тот, кто открыл нам Твои сокровенные сокровища.\n" +
                "        Он - последнее звено в цепи пророков, он победоносный помощник от Истинного, помогающий с помощью Истинного, он - тот, кто ведет людей по пути праведному!\n" +
                "        Ему и близким его нескончаемые славословия и приветствия.";
        //mtranslate.setTextSize(TypedValue.COMPLEX_UNIT_SP, 15f);

    }
*/
    Runnable r = new Runnable() {
        public void run(){
            if(currentPage < 0) currentPage = 0;
            if(currentPage > 30) currentPage = 30;
            arabic.setText(textsArabic[currentPage]);
            //mtranslate.setText(textsTranslate[currentPage]);
            handler.postDelayed(r,100);
        }
    };


}